Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/instance/sercom0.h
/*
 * Instance header file for WBZ653
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-05-07T20:51:46Z */
#ifndef _WBZ65_SERCOM0_INSTANCE_
#define _WBZ65_SERCOM0_INSTANCE_


/* ========== Instance Parameter definitions for SERCOM0 peripheral ========== */
#define SERCOM0_CHIP_SERCOM_CLK_REDUCTION        (1)        
#define SERCOM0_CHIP_SERCOM_DLY_COMPENSATION     (1)        
#define SERCOM0_CHIP_SERCOM_DMA                  (1)        
#define SERCOM0_CHIP_SERCOM_FIFO_DEPTH_POWER     (1)        
#define SERCOM0_CHIP_SERCOM_PADDR_MSB            (9)        
#define SERCOM0_CHIP_SERCOM_RETENTION_SUPPORT    (0)        
#define SERCOM0_CHIP_SERCOM_SE_CNT               (1)        
#define SERCOM0_CHIP_SERCOM_SPI                  (1)        
#define SERCOM0_CHIP_SERCOM_SPI_HW_SS_CTRL       (1)        
#define SERCOM0_CHIP_SERCOM_SPI_ICSPACE_EXT      (1)        
#define SERCOM0_CHIP_SERCOM_SPI_OZMO             (0)        
#define SERCOM0_CHIP_SERCOM_SPI_WAKE_ON_SSL      (1)        
#define SERCOM0_CHIP_SERCOM_TTBIT_EXTENSION      (1)        
#define SERCOM0_CHIP_SERCOM_TWIM                 (1)        
#define SERCOM0_CHIP_SERCOM_TWIS                 (1)        
#define SERCOM0_CHIP_SERCOM_TWIS_AUTO_ACK        (1)        
#define SERCOM0_CHIP_SERCOM_TWIS_GROUP_CMD       (1)        
#define SERCOM0_CHIP_SERCOM_TWIS_SDASETUP_CNT_SIZE (8)        
#define SERCOM0_CHIP_SERCOM_TWIS_SDASETUP_SIZE   (4)        
#define SERCOM0_CHIP_SERCOM_TWIS_SUDAT           (1)        
#define SERCOM0_CHIP_SERCOM_TWI_FASTMP           (1)        
#define SERCOM0_CHIP_SERCOM_TWI_HSMODE           (1)        
#define SERCOM0_CHIP_SERCOM_TWI_SCLSM_MODE       (1)        
#define SERCOM0_CHIP_SERCOM_TWI_SMB_TIMEOUTS     (1)        
#define SERCOM0_CHIP_SERCOM_TWI_TENBIT_ADR       (1)        
#define SERCOM0_CHIP_SERCOM_USART                (1)        
#define SERCOM0_CHIP_SERCOM_USART_AUTOBAUD       (1)        
#define SERCOM0_CHIP_SERCOM_USART_COLDET         (1)        
#define SERCOM0_CHIP_SERCOM_USART_FLOW_CTRL      (1)        
#define SERCOM0_CHIP_SERCOM_USART_FRAC_BAUD      (1)        
#define SERCOM0_CHIP_SERCOM_USART_IRDA           (1)        
#define SERCOM0_CHIP_SERCOM_USART_ISO7816        (1)        
#define SERCOM0_CHIP_SERCOM_USART_LIN_MASTER     (1)        
#define SERCOM0_CHIP_SERCOM_USART_RS485          (1)        
#define SERCOM0_CHIP_SERCOM_USART_SAMPA_EXT      (1)        
#define SERCOM0_CHIP_SERCOM_USART_SAMPR_EXT      (1)        
#define SERCOM0_DMAC_ID_RX                       (4)        
#define SERCOM0_DMAC_ID_TX                       (5)        
#define SERCOM0_GCLK_ID_CORE                     (3)        
#define SERCOM0_GCLK_ID_SLOW                     (3)        
#define SERCOM0_INSTANCE_ID                      (3)        /* Instance index for SERCOM0 */
#define SERCOM0_PAC_ID                           (3)        /* Index for SERCOM0 registers write protection */

#endif /* _WBZ65_SERCOM0_INSTANCE_ */
